Test task for React engineer (admin panel & tools)

Используя стороннее API в качестве источника данных (пример: Star Wars API https://swapi.dev/), 
реализовать SPA приложение React, состоящее из двух страниц:

1. На главной странице отобразить список или карточки персонажей, к списку добавить возможность пагинации.
2. Реализовать страницу с подробной информацией по выбранному персонажу.

Плюсы:
+ Использование TypeScript
+ Аккуратная верстка
+ Использование UI фреймворка (Material, Ant, Bootstrap и т.п.)

В качестве дополнительного задания:
+ реализовать поиск
+ Для работы с данными использовать хранилище Redux
+ Редактировать информацию о персонаже локально, без отправки на сервер
+ Написать тесты
